app/controllers/pages_controller.rb

    def index
        @pages = Page.all
---
SELECT "pages".* FROM "pages" ORDER BY "pages"."id" ASC LIMIT ?  [["LIMIT", 1]]

    def create
        @page = Page.new(page_params)
        @page.save
---
INSERT INTO "pages" ("title", "body", "slug", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "My Bio"], ["body", "dfs"], ["slug", "sdf"], ["created_at", "2023-09-28 07:26:20.431859"], ["updated_at", "2023-09-28 07:26:20.431859"]]

    def edit
        @page = Page.find(params[:id])
---
SELECT "pages".* FROM "pages" WHERE "pages"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

    def update
        @page = Page.find(params[:id])
        @page.update(page_params)
---
SELECT "pages".* FROM "pages" WHERE "pages"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "pages" SET "slug" = ?, "updated_at" = ? WHERE "pages"."id" = ?  [["slug", "About"], ["updated_at", "2023-09-28 12:34:20.238564"], ["id", 1]]