app/controllers/pages_controller.rb

    def destroy
        puts "hello this destroy zone"
        # set_page
        #destroying the current page
        @page.destroy
---
DELETE FROM "pages" WHERE "pages"."id" = ?  [["id", 24]]

    def set_page
        @page = Page.find(params[:id])
---
SELECT "pages".* FROM "pages" WHERE "pages"."id" = ? LIMIT ?  [["id", 21], ["LIMIT", 1]]