app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("title", "created_at", "updated_at", "body") VALUES (?, ?, ?, ?)  [["title", "Second Post!"], ["created_at", "2023-09-27 05:29:04.829655"], ["updated_at", "2023-09-27 05:29:04.829655"], ["body", nil]]